// Написать программу сложения двух чисел!
int numberA = 3;
int numberB = 2;
int result = numberA + numberB;
Console.WriteLine(result);